transonic-dlrbuffet-rhoCentralRKFoam/setups.orig/common/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
   "libcompressibleTurbulenceModels.so"
   "libfindroot.so"
   "libhisaFiniteVolume.so"
   "libvelocityOutletNSCBCx.so"
   "libpressureOutletNSCBC.so"
   "libtemperatureOutletNSCBC.so"
);

application     rhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1.0e-8;

writeControl    adjustableRunTime;

writeInterval   0.5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

maxCo           0.1;

maxDeltaT       1e-5;

adjustTimeStep no;

functions
{
    #include "FOMachNo"
    #include "FOvorticity"
    pressure
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        result          Cp;
        mode            staticCoeff;
        rho             rhoInf;
        rhoInf          0.5860;
        U               UInf;
        UInf            (416.6627 0 0);
        pInf            5.0461e+04;
        patches         (Blade);
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    writeTime;
        rho             rhoInf;
        rhoInf          0.5860;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0.75 0 0); // bump midpoint
        pitchAxis       (0 0 1);
        magUInf         416.6627;
        lRef            0.07; // length of bump
        Aref            0.000006; // mesh span = 0.006, bump height = 0.001; 0.006*0.001= 0.000006
        patches         (Blade);
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (Blade);
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (Blade);
    }

    cellCentres
    {
        type            writeCellCentres;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (".*");
    }
}

optimisationSwitches
{
     fileHandler collated;
}

// ************************************************************************* //
