transonic-dlrbuffet-rhoCentralRKFoam/setups.orig/common/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//omegaInlet      79859.57062499248;
kInlet          45937.5;
//http://ichrome.com/blogs/archives/342
//Length L=0.07;velocity=350;Kinematic viscosity v=1.75e-5;Turbulence intensity I=0.5%

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    INLET
    {
        type turbulentIntensityKineticEnergyInlet;
        U    U;
        phi  phi;
        intensity 0.05;
        value uniform $kInlet; 
    }

    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;
    }
        OUTLET
    {
        //type zeroGradient;
        type     inletOutlet;
        inletValue   uniform  $kInlet;
        value        uniform  $kInlet;
    }
    Blade
    {
        type            kLowReWallFunction; //low-y+ walls
        value           uniform 100;

        //type zeroGradient;
//        type      kqRWallFunction;
//        value     uniform 121;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
